In [1]:
# Bismillah

In [2]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last':  ['Schafer', 'Doe', 'Doe'],
    'email': ['coreyschafer@email.com', 'janedoe@email.com', 'johndoe@email.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@email.com
1   Jane      Doe       janedoe@email.com
2   John      Doe       johndoe@email.com

In [6]:
# Vmportant:  df.loc[index position or 0], df.loc[filt or label], df.loc[filt or label, ['colum heading or key',
# 'column heading or key', 'column heading or key'], df['column heading or key'] all are valid but df.loc['column
# heading or key'] is not valid.

In [7]:
df.loc[0] # with loc or iloc, we have to use index position, which produces that index position row.

first                     Corey
last                    Schafer
email    coreyschafer@email.com
Name: 0, dtype: object

In [8]:
df['last'] # without loc or iloc, column name (key) produces the values in that column in a series.

0    Schafer
1        Doe
2        Doe
Name: last, dtype: object

In [9]:
df['last'] == 'Doe' # tests the condition (without if) to look for 'Doe' in the column named, last. Where 'Doe' is found,
# True is produced.

0    False
1     True
2     True
Name: last, dtype: bool

In [10]:
filt = (df['last'] == 'Doe') # The R.H.S of equality sign evaluates to a series of True and False as shown above, which
# is stored in the variable, filt as shown below.

In [11]:
filt

0    False
1     True
2     True
Name: last, dtype: bool

In [12]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@email.com
1   Jane      Doe       janedoe@email.com
2   John      Doe       johndoe@email.com

In [13]:
df[filt] # applies the filter to dataframe and produces those rows where 'filt' contains True. Note that 'filt' is a 
# filter containing True and False, and not a column name in data frame. Also, note that there are no '' around 
# filt in [] like we have got them ('') in case of column name or keys.

  first last              email
1  Jane  Doe  janedoe@email.com
2  John  Doe  johndoe@email.com

In [14]:
df.loc[filt] # thus df.loc[filt] is the same as df[filt] since both produces those rows from the dataframe where 
# 'filt' contains True. The loc has additional advantage of allowing to extract a specific column as shown below.

  first last              email
1  Jane  Doe  janedoe@email.com
2  John  Doe  johndoe@email.com

In [15]:
df.loc[filt, 'email'] # df.loc[filt or series of True and False] produces those rows of dataframe where filter 
# criteria is met with (True cases). ['email'] is for column and produces email addresses of only those rows which 
# meets the filter criteria. Note that '' are around column name/key but not around filter, filt.

1    janedoe@email.com
2    johndoe@email.com
Name: email, dtype: object

In [16]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@email.com
1   Jane      Doe       janedoe@email.com
2   John      Doe       johndoe@email.com

In [17]:
filt1 = (df['last'] == 'Doe') & (df['first'] == 'John') # the two () are mandatory. Or, & has to be between two ().

In [18]:
filt1

0    False
1    False
2     True
dtype: bool

In [19]:
df.loc[filt1] # produces those rows from the dataframe where filter criteria is met with (True cases)

  first last              email
2  John  Doe  johndoe@email.com

In [20]:
df.loc[filt1]['email'] # produces emails from the dataframe where filter criteria is met with (True cases)

2    johndoe@email.com
Name: email, dtype: object

In [21]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@email.com
1   Jane      Doe       janedoe@email.com
2   John      Doe       johndoe@email.com

In [22]:
filt2 = (df['last'] == 'Schafer') | (df['first'] == 'John') # use of or (|) operator.

In [23]:
filt2

0     True
1    False
2     True
dtype: bool

In [24]:
df.loc[filt2]['email']

0    coreyschafer@email.com
2         johndoe@email.com
Name: email, dtype: object

In [25]:
~filt2

0    False
1     True
2    False
dtype: bool

In [26]:
df.loc[~filt2]

  first last              email
1  Jane  Doe  janedoe@email.com